
fun main() {
    println("Целочисленные типы данных:")
    println("Byte|от -128 до 127|занимает 1 байт" )
    println("Short|от -32 768 до 32 767|занимает 2 байта")
    println("Int|от -2^31 до 2^31 - 1|занимает 4 байта")
    println("Long|от -2^63 до 2^63 - 1|занимает 8 байт\n")

    println("Вещественные типы данных:")
    println("Float|от -3.4 * 10^38 до 3.4 * 10^38|занимает 4 байта")
    println("Double|от +-5.0 * 10^-324 до +-1.7 * 10^308|занимает 8 байт\n")

    println("Логические типы данных:")
    println("Boolean|true/false\n")

    println("Символы/Строки:")
    println("Char|один символ")
    println("String|последовательность символов")




}